## Plan Result (demo-global)




<pre><code>Plan: 59 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ac-int-gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;adoption-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;bar&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;bar-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;civil-citizen-ui&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;cmc&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;cmc-legal&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-da&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-dn&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-pfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-rfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ds-ui&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;em-icp&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-sya&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fis-ds-update-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fis-ds-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ia-aip&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;judicial-payments&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;lau&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;lau-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv-apply&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv-civil&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paymentoutcome-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paymentoutcome-web-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pcq&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pcq-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pet-app1&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pet-app2&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;privatelaw&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;probate&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;return-case-doc-ccd-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;rpts&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sptribs-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-cor&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tribunals&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tya&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;wa-proto-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-register-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;paymentoutcome-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;paymentoutcome-web-int&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"
        name                                 = "hmcts-demo"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (11 unchanged attributes hidden)

      + backend_pool {
          + health_probe_name   = "healthProbeSettings-div-dn"
          + load_balancing_name = "loadBalancingSettings-div-dn"
          + name                = "div-dn"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "decree-nisi-aks.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-div-da"
          + load_balancing_name = "loadBalancingSettings-div-da"
          + name                = "div-da"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "decree-absolute-aks.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-div-rfe"
          + load_balancing_name = "loadBalancingSettings-div-rfe"
          + name                = "div-rfe"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "respond-divorce-aks.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-div-pfe"
          + load_balancing_name = "loadBalancingSettings-div-pfe"
          + name                = "div-pfe"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "petitioner-frontend-aks.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-pet-app1"
          + load_balancing_name = "loadBalancingSettings-pet-app1"
          + name                = "pet-app1"

          + backend {
              + address     = "firewall-prod-int-palo-pet-demo.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "pet-app1.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-pet-app2"
          + load_balancing_name = "loadBalancingSettings-pet-app2"
          + name                = "pet-app2"

          + backend {
              + address     = "firewall-prod-int-palo-pet-demo.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "pet-app2.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-sscs-tribunals"
          + load_balancing_name = "loadBalancingSettings-sscs-tribunals"
          + name                = "sscs-tribunals"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "benefit-appeal.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-sscs-cor"
          + load_balancing_name = "loadBalancingSettings-sscs-cor"
          + name                = "sscs-cor"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "sscs-cor.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-sscs-tya"
          + load_balancing_name = "loadBalancingSettings-sscs-tya"
          + name                = "sscs-tya"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "track-appeal.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-webapp"
          + load_balancing_name = "loadBalancingSettings-xui-webapp"
          + name                = "xui-webapp"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "manage-case.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-manage-org"
          + load_balancing_name = "loadBalancingSettings-xui-manage-org"
          + name                = "xui-manage-org"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "manage-org.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-manage-org-int"
          + load_balancing_name = "loadBalancingSettings-xui-manage-org-int"
          + name                = "xui-manage-org-int"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "manage-org-int.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-approve-org"
          + load_balancing_name = "loadBalancingSettings-xui-approve-org"
          + name                = "xui-approve-org"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "administer-orgs.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-approve-org-int"
          + load_balancing_name = "loadBalancingSettings-xui-approve-org-int"
          + name                = "xui-approve-org-int"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "administer-orgs-int.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-register-org"
          + load_balancing_name = "loadBalancingSettings-xui-register-org"
          + name                = "xui-register-org"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "register-org.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-civil-citizen-ui"
          + load_balancing_name = "loadBalancingSettings-civil-citizen-ui"
          + name                = "civil-citizen-ui"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "civil-citizen-ui.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-cmc"
          + load_balancing_name = "loadBalancingSettings-cmc"
          + name                = "cmc"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "moneyclaims.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-cmc-legal"
          + load_balancing_name = "loadBalancingSettings-cmc-legal"
          + name                = "cmc-legal"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "moneyclaims-legal.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-fact"
          + load_balancing_name = "loadBalancingSettings-fact"
          + name                = "fact"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "fact.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-fact-admin"
          + load_balancing_name = "loadBalancingSettings-fact-admin"
          + name                = "fact-admin"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "fact-admin.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-rpts"
          + load_balancing_name = "loadBalancingSettings-rpts"
          + name                = "rpts"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "rpts.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-nfdiv"
          + load_balancing_name = "loadBalancingSettings-nfdiv"
          + name                = "nfdiv"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "nfdiv.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-et-sya"
          + load_balancing_name = "loadBalancingSettings-et-sya"
          + name                = "et-sya"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "et-sya.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-ia-aip"
          + load_balancing_name = "loadBalancingSettings-ia-aip"
          + name                = "ia-aip"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "immigration-appeal.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-wa-proto-frontend"
          + load_balancing_name = "loadBalancingSettings-wa-proto-frontend"
          + name                = "wa-proto-frontend"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "wa-proto-frontend.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-gateway-ccd"
          + load_balancing_name = "loadBalancingSettings-gateway-ccd"
          + name                = "gateway-ccd"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "gateway-ccd.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-gateway-ccd-int"
          + load_balancing_name = "loadBalancingSettings-gateway-ccd-int"
          + name                = "gateway-ccd-int"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "gateway-ccd-int.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-ac-int-gateway-ccd"
          + load_balancing_name = "loadBalancingSettings-ac-int-gateway-ccd"
          + name                = "ac-int-gateway-ccd"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "ac-int-gateway-ccd.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-return-case-doc-ccd"
          + load_balancing_name = "loadBalancingSettings-return-case-doc-ccd"
          + name                = "return-case-doc-ccd"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "return-case-doc-ccd.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-return-case-doc-ccd-int"
          + load_balancing_name = "loadBalancingSettings-return-case-doc-ccd-int"
          + name                = "return-case-doc-ccd-int"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "return-case-doc-ccd-int.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-pcq"
          + load_balancing_name = "loadBalancingSettings-pcq"
          + name                = "pcq"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "pcq.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-pcq-int"
          + load_balancing_name = "loadBalancingSettings-pcq-int"
          + name                = "pcq-int"

          + backend {
              + address     = "firewall

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/paybubble-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["paymentoutcome-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/paymentoutcome-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["paymentoutcome-web-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/paymentoutcome-web-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["pcq"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/pcq"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["pcq-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/pcq-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["pet-app1"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/pet-app1"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["pet-app2"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/pet-app2"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["privatelaw"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/privatelaw"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["probate"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/probate"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["return-case-doc-ccd"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/return-case-doc-ccd"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["return-case-doc-ccd-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/return-case-doc-ccd-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["rpts"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/rpts"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sptribs-frontend"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/sptribs-frontend"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sscs-cor"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/sscs-cor"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sscs-tribunals"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/sscs-tribunals"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sscs-tya"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/sscs-tya"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["wa-proto-frontend"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/wa-proto-frontend"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-approve-org"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-approve-org"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-approve-org-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-approve-org-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-manage-org"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-manage-org"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-manage-org-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-manage-org-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-register-org"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-register-org"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-webapp"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-webapp"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect["paymentoutcome-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https_www_redirect" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/wwwpaymentoutcome-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect["paymentoutcome-web-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https_www_redirect" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/wwwpaymentoutcome-web-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 59 to add, 2 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["fees-register"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/feesregisterdemo"
        name                              = "feesregisterdemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (6 unchanged attributes hidden)

      ~ custom_rule {
            name                           = "IPMatchWhitelist"
            # (6 unchanged attributes hidden)

          ~ match_condition {
              + transforms         = []
                # (4 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["fees-register-int"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/feesregisterintdemo"
        name                              = "feesregisterintdemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (6 unchanged attributes hidden)

      ~ custom_rule {
            name                           = "IPMatchWhitelist"
            # (6 unchanged attributes hidden)

          ~ match_condition {
              + transforms         = []
                # (4 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pcq"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/pcqdemo"
        name                              = "pcqdemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (6 unchanged attributes hidden)

      ~ custom_rule {
            name                           = "RumBeaconExclusion"
            # (6 unchanged attributes hidden)

          ~ match_condition {
              + transforms         = []
                # (4 unchanged attributes hidden)
            }
          ~ match_condition {
              + transforms         = []
                # (4 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pcq-int"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/pcqintdemo"
        name                              = "pcqintdemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (6 unchanged attributes hidden)

      ~ custom_rule {
            name                           = "RumBeaconExclusion"
            # (6 unchanged attributes hidden)

          ~ match_condition {
              + transforms         = []
                # (4 unchanged attributes hidden)
            }
          ~ match_condition {
              + transforms         = []
                # (4 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["probate"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/probatedemo"
        name                              = "probatedemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (6 unchanged attributes hidden)

      ~ custom_rule {
            name                           = "RumBeaconExclusion"
            # (6 unchanged attributes hidden)

          ~ match_condition {
              + transforms         = []
                # (4 unchanged attributes hidden)
            }
          ~ match_condition {
              + transforms         = []
                # (4 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1465,"Program":"tfcmt","SHA1":"","Target":"demo-global","Vars":{}} -->